app/controllers/clothes_controller.rb

  def index
    params[:page] = (params[:page] ||= '1')
    @page = params[:page].to_i # this is used for page nav. TODO: move this into javascript
    @clothes = []
    @url_function = WebsiteUrlFunction.find_by(name: 'page')
    @user_settings = UserSettingsService.call(cookies)
    @user_settings[:website_ids].each do |website_id|
      @website = Website.find(website_id)
---
SELECT  "websites".* FROM "websites" WHERE "websites"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def search
    params[:page] = (params[:page] ||= '1')
    @page = params[:page] # this is used for page nav. TODO: move this into javascript
    @clothes = []
    @url_function = WebsiteUrlFunction.find_by(name: 'search')
    @user_settings = UserSettingsService.call(cookies)
    @user_settings[:website_ids].each do |website_id|
      @website = Website.find(website_id)
---
SELECT  "websites".* FROM "websites" WHERE "websites"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def settings
    @websites = Website.all
    @categories = Category.all
    @genders = Gender.all
---
SELECT "websites".* FROM "websites"
SELECT "categories".* FROM "categories"
SELECT "genders".* FROM "genders"