app/models/scraper_html.rb

SELECT "scraper_html_components".* FROM "scraper_html_components" WHERE "scraper_html_components"."scraper_html_id" = ?  [["scraper_html_id", 1]]
---
    def scrape(html, base_url)
        return html.css(self.container_selector).map { |container|
            Hash[self.scraper_html_components.map { |component|
                [component.name, component.scrape({:html=>container,:base_url=>base_url})]
            }]