app/models/scraper.rb

    def scrape(url_extension)
        page = get_html(url_extension)
        page.css(self.container_selector).map { |container|
            Hash[self.scraper_components.map { |component|
                [component.name, component.scrape(container)]
            }]
---
SELECT "scraper_components".* FROM "scraper_components" WHERE "scraper_components"."scraper_id" = ?  [["scraper_id", 1]]