app/models/website.rb

SELECT  "website_url_htmls".* FROM "website_url_htmls" WHERE "website_url_htmls"."website_id" = ? AND "website_url_htmls"."gender_id" = ? AND "website_url_htmls"."category_id" = ? LIMIT ?  [["website_id", 1], ["gender_id", 1], ["category_id", 1], ["LIMIT", 1]]
SELECT  "website_urls".* FROM "website_urls" WHERE "website_urls"."type" IN ('WebsiteUrlCategory') AND "website_urls"."website_id" = ? AND "website_urls"."gender_id" = ? AND "website_urls"."category_id" = ? LIMIT ?  [["website_id", 1], ["gender_id", 1], ["category_id", 1], ["LIMIT", 1]]
---
    def scrape(user_settings, params)
        @website_url = self.website_url_htmls.find_by(gender_id: user_settings[:gender_id], category: user_settings[:category_id])